importing libraries

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

Iris Dataset

In [4]:
df = sns.load_dataset('iris')

In [5]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

Titanic dataset

In [6]:
df2 = sns.load_dataset('titanic')

In [7]:
df2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

Sample dataset

In [55]:
data = [23,32,122,322,1,2]

In [56]:
#creating data copy
data_copy = data.copy()
data_copy

[23, 32, 122, 322, 1, 2]

In [57]:
#sorting data
data_copy.sort()
data_copy

[1, 2, 23, 32, 122, 322]

In [58]:
#mean of data
np.mean(data)
np.median(data)

27.5

In [60]:
#way to calculate dataframe column mena
df['sepal_length'].mean()

5.843333333333334

In [59]:
#dataframe column mean
np.mean(df['sepal_length'])

5.843333333333334

In [62]:
#dataframe column median
df['sepal_width'].median()

3.0

In [63]:
# for mode
import statistics
statistics.mode(data)

23

In [64]:
# mean using python function
def mean(data):
    sum = 0
    for i in data:
        sum = sum+i
        mean_value = sum/len(data)
    return mean_value

In [65]:
mean(data)

83.66666666666667

Percentile

In [66]:
np.percentile(data,[25,50,75])

array([ 7.25, 27.5 , 99.5 ])

In [69]:
df['sepal_length'].describe()

count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000
Name: sepal_length, dtype: float64

In [40]:
data1 = [23,23,332,123,3433,45]

In [53]:
def mode(data):
    add = 0
    for i in range(len(data)):
        val = data.count(data[i])
        print(val)
    return val

In [54]:
mode(data1)

2
2
1
1
1
1

1

In [26]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000